Backlinks.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-28 Sat 17:59 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Backlinks</title>
<meta name="generator" content="Org mode" />
</head>
<body>
<div id="content">
<h1 class="title">Backlinks</h1>
<div id="outline-container-org550e90f" class="outline-2">
<h2 id="org550e90f">Backlinks</h2>
<div class="outline-text-2" id="text-org550e90f">
<p>
It can be useful to search for all notes that link to the current note. You can use <code>org-occur-link-in-agenda-files</code> to search for backlinks to the current node.
</p>

<p>
Unfortunately, out of the box this requires that the link description exactly match the title of the node. Here is an alternative solution that searchs for any backlink, no matter the description.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">zorg-backlinks</span> <span style="color: #7388D6;">()</span>
  <span style="color: #036A07;">"Search for backlinks to current entry."</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>link <span style="color: #907373;">(</span><span style="color: #0000FF;">condition-case</span> nil
                  <span style="color: #6276BA;">(</span>org-id-store-link<span style="color: #6276BA;">)</span>
                <span style="color: #6276BA;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"Unable to create a link to here"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>org-occur-in-agenda-files <span style="color: #709870;">(</span>regexp-quote link<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
If you use <a href="https://github.com/alphapapa/org-ql">org-ql</a> you might prefer this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">zorg-backlinks</span> <span style="color: #7388D6;">()</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">interactive</span><span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>link <span style="color: #907373;">(</span><span style="color: #0000FF;">condition-case</span> nil
                  <span style="color: #6276BA;">(</span>org-id-store-link<span style="color: #6276BA;">)</span>
               <span style="color: #6276BA;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #008000;">"Unable to create a link to here"</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>query `<span style="color: #907373;">(</span>link <span style="color: #006FE0;">:target</span> ,link<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>org-ql-search
      org-agenda-text-search-extra-files
      query
      <span style="color: #006FE0;">:title</span> <span style="color: #709870;">(</span>concat <span style="color: #008000;">"Links to: "</span> <span style="color: #907373;">(</span>org-get-heading t t<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
If you use <a href="https://github.com/alphapapa/org-ql">org-ql</a> and you want to maintain a <a href="https://orgmode.org/manual/Dynamic-Blocks.html">dynamic block</a> of backlinks, you can use this:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #707183;">(</span><span style="color: #0000FF;">defun</span> <span style="color: #006699;">org-dblock-write:zorg-backlinks</span> <span style="color: #7388D6;">(</span><span style="color: #6434A3;">&amp;rest</span> params<span style="color: #7388D6;">)</span>
  <span style="color: #7388D6;">(</span><span style="color: #0000FF;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>elements <span style="color: #907373;">(</span>org-ql-query
                    <span style="color: #006FE0;">:from</span> org-agenda-text-search-extra-files
                    <span style="color: #006FE0;">:where</span> `<span style="color: #6276BA;">(</span>link <span style="color: #006FE0;">:target</span> ,<span style="color: #858580;">(</span>org-id-store-link<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #0000FF;">dolist</span> <span style="color: #709870;">(</span>element elements<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>org-make-link-string <span style="color: #6276BA;">(</span>concat <span style="color: #008000;">"id:"</span> <span style="color: #858580;">(</span>org-element-property <span style="color: #006FE0;">:ID</span> element<span style="color: #858580;">)</span><span style="color: #6276BA;">)</span>
                                    <span style="color: #6276BA;">(</span>org-element-property <span style="color: #006FE0;">:raw-value</span> element<span style="color: #6276BA;">)</span><span style="color: #907373;">)</span>
              <span style="color: #008000;">"\n"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>delete-char -1<span style="color: #909183;">)</span><span style="color: #7388D6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
You can then add dynamic blocks:
</p>

<p>
<a href="START HERE.html#ID-b9c8bf44-3980-4026-8737-cc546a166d31">Start here</a>
</p>

<p>
These can be updated using <code>C-c C-c</code> on the block. For other options to keep the blocks up to date, see the <a href="https://orgmode.org/manual/Dynamic-Blocks.html">documentation</a>.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2020-11-28 Sat 17:59</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
